---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetDesignedBy
source: html/5f37744d-efcd-f1fe-4cc1-0da506f57e80.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetDesignedBy Property

"Designed By"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetDesignedBy { get; }
```